using Microsoft.EntityFrameworkCore;
using Microsoft.VisualStudio.TestTools.UnitTesting;
using Xw.Zx.Core.Models.Model;
using Xw.Zx.Core.Service.Parse;

namespace UnitTestProject1
{
    [TestClass]
    public class UnitTest1
    {
        

        [TestMethod]
        public void TestMethod1()
        {
            var mail = new MailSrc() {
                MemberId = 6,
                Id = 6,
                BodyText = "尊敬的 夏蔚 先生，您好！以下是您的招商银行信用卡03月账单   2016/02/10-2016/03/09(补)   ￥7,983.30 ￥968.69   ￥7,983.30 ￥968.69   ￥7,983.30 ￥9,338.01 ￥3,000.00 ￥1,456.00 ￥0.00 ￥189.29   0210 0211 微信支付(Tenpay):滴滴专车 ￥ 31.80 2898  31.80   0213 0214 （特约）北京易到旅行社有限公司 ￥ 5.00 2898  5.00   0214 0215 微信支付(Tenpay):航班管家 ￥ 93.00 2898  93.00   0215 0216 中国铁路总公司资金清算中心 ￥ 12.00 2898  12.00   0215 0216 微信支付(Tenpay):滴滴专车 ￥ 13.70 2898  13.70   0215 0217 微信支付(Tenpay):滴滴专车 ￥ 11.30 2898  11.30   0216 0217 微信支付(Tenpay):滴滴专车 ￥ 23.00 2898  23.00   0216 0217 微信支付(Tenpay):滴滴专车 ￥ 39.90 2898  39.90   0217 0218 微信支付(Tenpay):滴滴专车 ￥ 18.20 2898  18.20   0217 0218 微信支付(Tenpay):滴滴专车 ￥ 20.10 2898  20.10   0221 0222 微信支付(Tenpay):滴滴专车 ￥ 19.50 2898  19.50   0221 0222 微信支付(Tenpay):滴滴专车 ￥ 36.30 2898  36.30   0222 0223 郑州市祥和百货超市 ￥ 178.00 2898  178.00   0222 0223 跨行转账还款 ￥- 1,000.00 2898  -1,000.00   0224 0225 支付宝-中国铁路总公司资金清算中心 ￥ 251.00 2898  251.00   0228 0229 微信支付(Tenpay):滴滴专车 ￥ 51.50 2898  51.50   0228 0229 支付宝-中国铁路总公司资金清算中心 ￥ 251.00 2898  251.00   0228 0229 星巴克咖啡有限公司 ￥ 25.00 2898  25.00   0228 0229 支付宝-杨福禄 ￥ 38.00 2898  38.00   0302 0303 微信支付(Tenpay):滴滴专车 ￥ 24.30 2898  24.30   0303 0304 北京京东三佰陆拾度电子商务公司 ￥ 14.70 2898  14.70   0304 0305 财付通网络还款 ￥- 2,000.00 2898  -2,000.00   0304 0306 微信支付(Tenpay):滴滴专车 ￥ 18.10 2898  18.10   0304 0305 河南很久以前餐饮服务有限公司 ￥ 224.00 2898  224.00   0307 0308 微信支付(Tenpay):滴滴专车 ￥ 31.00 2898  31.00   0307 0308 微信支付(Tenpay):滴滴专车 ￥ 13.20 2898  13.20   0307 0308 微信支付(Tenpay):滴滴专车 ￥ 12.40 2898  12.40   0309 0309 循环利息 ￥ 189.29   ★ 上述交易摘要中的商户名称仅供您参考，如与签购单不符，请以签购单为准。   ★ 若您的人民币或美元账户的“本期应还金额”为负数，表示本期该人民币或美元账户中尚有存款，您不需   另行存款，本期账单仅供您作为对账参考。   ★ 通过本行系统缴款，您的信用额度一般可于缴款后立即恢复。   ★ 账单分期申请办理成功后，会自动生成一笔负向交易金额冲抵账单金额，该负向交易金额等于分期金额。对已出账单申请分期，负向交易金额的交易日对应为客户的账单日；对未出账单申请分期，负向交易金额的交易日为客户的分期申请日；账单分期的入账日为客户的分期申请日（20：00前申请）或分期申请次日（20：00后申请）。   ★友情提醒：依据《征信业管理条例》相关规定，我行会如实上传您的个人信用信息至金融信用信息基础数据库，该信息将对您与银行等金融机构发生的借贷业务产生重要影响，为维护良好的信用记录，请您及时还款！   ★欢迎使用招商银行信用卡官方客户端——掌上生活还款，即可体验随时随地查账还款、一键分期、积分兑换等多项服务，更支持招行和多家他行借记卡0手续费还款，实时恢复额度！"
            };
            var prase = new ZhaoShangParse();
            prase.Parse2(mail);
            Assert.IsTrue(mail.Id>6);
        }


    }
}
